[
  {
    "id": "1",
    "title": "2000 Years",
    "duration": 241800,
    "path": "2000_years.mp3",
    "lyric": "It's more than 2000 years<br/>Since I come here<br/>And all I can say is<br/><br/>Why o why, o why?<br/>Why o why, o why?<br/><br/>Why o why, o why?<br/>Why o why, o why?<br/>Yeah!<br/><br/>Hear dem say<br/>Why o why, o why?<br/>Why o why, o why?<br/><br/>Using my brothers and my sisters<br/>I wonder why<br/>They're using my brothers and my sisters<br/>I wonder why<br/><br/>Hear dem say<br/>Why o why, o why?<br/>Why o why, o why?<br/><br/>Hear dem<br/>Why o why, o why?<br/>Why o why, o why?<br/><br/>He was helping Jah Jah<br/>Why o why, o why?<br/>Why o why, o why?<br/><br/>(..)<br/><br/>Don't feel so sad, so son<br/>Feel like say hello<br/>But if I should<br/>They woulda beat I down<br/><br/>All I can say is<br/>All I can say<br/><br/>Why o why, o why?<br/>Why o why, o why?<br/>Jah Jah!<br/><br/>Why o why, o why?<br/>Why o why, o why?<br/><br/>Give us an helping hand<br/>Why o why, o why?<br/>Why o why, o why?It's more than 2000 years<br/>Since I come here<br/>And all I can say is<br/><br/>Why o why, o why?<br/>Why o why, o why?<br/><br/>Why o why, o why?<br/>Why o why, o why?<br/>Yeah!<br/><br/>Hear dem say<br/>Why o why, o why?<br/>Why o why, o why?<br/><br/>Using my brothers and my sisters<br/>I wonder why<br/>They're using my brothers and my sisters<br/>I wonder why<br/><br/>Hear dem say<br/>Why o why, o why?<br/>Why o why, o why?<br/><br/>Hear dem<br/>Why o why, o why?<br/>Why o why, o why?<br/><br/>He was helping Jah Jah<br/>Why o why, o why?<br/>Why o why, o why?<br/><br/>(..)<br/><br/>Don't feel so sad, so son<br/>Feel like say hello<br/>But if I should<br/>They woulda beat I down<br/><br/>All I can say is<br/>All I can say<br/><br/>Why o why, o why?<br/>Why o why, o why?<br/>Jah Jah!<br/><br/>Why o why, o why?<br/>Why o why, o why?<br/><br/>Give us an helping hand<br/>Why o why, o why?<br/>Why o why, o why?<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "2",
    "title": "African Postman",
    "duration": 314400,
    "path": "african_postman.mp3",
    "lyric": "Son, who is that knocking out there<br/>It's an African postman daddy<br/>African postman, ye-s a me brother<br/>Woooo a me brother<br/>This African post man bring I and I and I a telegram<br/>African postman<br/>African postman<br/>African postman<br/>Telegram say<br/><br/>Sons and daughters of His Imperial Majesty<br/>Haile Selassie<br/>Earth rightful Ruler<br/>Without any apology say<br/>This is the time, when I and I and I and should<br/>Come home, yes Jah<br/>Come hold the fort, come hold the fort<br/>Nay leggo Nay leggo<br/>Heng on, heng on, heng on, heng on, heng on<br/>Come hold the fort we a hold<br/>The fort, we a hold the fort<br/>Give thanks to this African postman<br/>African postman, African postman<br/><br/>The telegram was so interesting and<br/>Essential and important to I and I as African<br/>Bless and keep this postman<br/>Guidance be with this postman<br/>Providence, this African postman a Ia Ia Ia Ia I<br/>Brother, African brother<br/>To a brother is a brother<br/>African postman, African postman, African postman<br/>Who bring Ia Ia Ia I a telegram<br/><br/>Saying that, sons and daughters of His Imperial Majesty<br/>Haile Selassie<br/>Earth rightful Ruler<br/>Without any apology saying<br/>This the time when I and I and I<br/>Should come yes Jah<br/>Come on hold the fort, we a hold<br/>The fort I and I yound<br/>Come hold the fort<br/>Nay leggo heng on Nay leggo heng on<br/>Nay leggo heng on nay leggo<br/>We a hold the fort, come hold the fort<br/>We a hold the fort<br/>Son yes Daddy<br/>Who is that calling outside<br/>It's a postman Daddy<br/>What kind of a man is he<br/>Saying that, sons and daughters of His Im<br/>Of His Imperial Majesty<br/>Haile Sel assie<br/>Earth rightful Ruler<br/>Without any apology say<br/>This is the time, when Ia Ia Ia<br/>Should come home, yes Jah<br/>Come hold the fort<br/>Nay leggo heng on nay leggoSon, who is that knocking out there<br/>It's an African postman daddy<br/>African postman, ye-s a me brother<br/>Woooo a me brother<br/>This African post man bring I and I and I a telegram<br/>African postman<br/>African postman<br/>African postman<br/>Telegram say<br/><br/>Sons and daughters of His Imperial Majesty<br/>Haile Selassie<br/>Earth rightful Ruler<br/>Without any apology say<br/>This is the time, when I and I and I and should<br/>Come home, yes Jah<br/>Come hold the fort, come hold the fort<br/>Nay leggo Nay leggo<br/>Heng on, heng on, heng on, heng on, heng on<br/>Come hold the fort we a hold<br/>The fort, we a hold the fort<br/>Give thanks to this African postman<br/>African postman, African postman<br/><br/>The telegram was so interesting and<br/>Essential and important to I and I as African<br/>Bless and keep this postman<br/>Guidance be with this postman<br/>Providence, this African postman a Ia Ia Ia Ia I<br/>Brother, African brother<br/>To a brother is a brother<br/>African postman, African postman, African postman<br/>Who bring Ia Ia Ia I a telegram<br/><br/>Saying that, sons and daughters of His Imperial Majesty<br/>Haile Selassie<br/>Earth rightful Ruler<br/>Without any apology saying<br/>This the time when I and I and I<br/>Should come yes Jah<br/>Come on hold the fort, we a hold<br/>The fort I and I yound<br/>Come hold the fort<br/>Nay leggo heng on Nay leggo heng on<br/>Nay leggo heng on nay leggo<br/>We a hold the fort, come hold the fort<br/>We a hold the fort<br/>Son yes Daddy<br/>Who is that calling outside<br/>It's a postman Daddy<br/>What kind of a man is he<br/>Saying that, sons and daughters of His Im<br/>Of His Imperial Majesty<br/>Haile Sel assie<br/>Earth rightful Ruler<br/>Without any apology say<br/>This is the time, when Ia Ia Ia<br/>Should come home, yes Jah<br/>Come hold the fort<br/>Nay leggo heng on nay <br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "3",
    "title": "African Teacher",
    "duration": 240600,
    "path": "african_teacher.mp3",
    "lyric": "Teach me, teach me, teach me, teach me, Teacher<br/>Teach I and I Amharic Teacher<br/>Teach me, teach me, teach me, teach me, Teacher<br/>Teach I and I African Teacher<br/><br/>I never be late, I always early<br/>I never absent I always present<br/>That's why I and I nah sit down inna no back bench<br/>Natty like to be bright, bright, bright<br/>So bright<br/>Bright, bright, bright<br/>So bright<br/><br/>African teaching is a part of I and I<br/>Culture O yes part of I and I<br/>Teach me, teach me, teach me, teach me, Teacher<br/>Teach I and I Amharic Teacher<br/><br/>I admit we go to school<br/>But we never finish<br/>Not until we reach upon<br/>The soil of Africa, where in<br/>I and I can be teached by African Teachers<br/>O yes I and I can be teached by African Teachers<br/><br/>Teach me, teach me, teach me, teach me, Teacher<br/>Teach I and I Amharic Teacher<br/>Teach me, teach me, teach me, teach me, Teacher<br/>Teach I and I Amharic Teacher<br/><br/>O right teach I and I and I Amharic<br/>I like to be teached by African, African Teacher<br/>So right, Natty like to be bright so bright<br/>So bright so bright brighter bright<br/>Bright Natty Bright Natty Bright Natty Bright<br/>So bright natty like to be teached by African Teacher<br/>Teacher<br/>Teach natty Amharic Teacher<br/>Is a part of I and I<br/>So right<br/>Natty Teacher, Amharic Teacher, African Teacher<br/>Teach I and I and I and I Amharic Teacher<br/>Teach I and I and I and I natty like to be bright so bright<br/><br/>I and I<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "4",
    "title": "Black Wa Da Da",
    "duration": 254400,
    "path": "black_wa_da_da.mp3",
    "lyric": "[Intro]<br/>They take us away from Africa<br/>With the intention to steal our culture<br/>The good father pass by and say<br/>Humble yourself, my little one<br/>Humble yourself, my children<br/>Humble yourself<br/><br/>[Chorus]<br/>Oh my brothers it is<br/>Wadada wo-oh-oh wadada<br/>Who I-lier than I-ly<br/>Wadada wo-oh-oh wadada<br/>Means love in Africa<br/>Wadada wo-ho-ho wadada<br/>Love I-niversally<br/>My interpretation love universal<br/>Wadada wo-ho-ho wadada<br/><br/>[Verse 1]<br/>Love in Africa<br/>Love in America<br/>Love in Canada<br/><br/>[Chorus]<br/>Wadada wo-ho-ho wadada<br/>Who I-lier than I-ly<br/>Wadada wo-ho-ho wadada<br/><br/>[Verse 2]<br/>Every knee shall bend (shall bend, shall bend)<br/>Every tongue shall tell (shall tell, shall tell)<br/>Down in this valley, down in this valley<br/>Down in this valley of Jehoshaphat<br/>Where is your love Jamaicans?<br/>Where is your love Jamaicans?<br/>Where is your love Jamaicans?<br/><br/>[Bridge]<br/>I can't see your love<br/>I can't feel your love<br/>Nor even touch your love<br/>I don't know about your love<br/>Taught them the way to love one another<br/><br/>[Outro]<br/>Wadada wo-ho-ho wadada<br/>Who I-lier than I-ly<br/>Wadada wo-ho-ho wadada<br/>Black guidance be with I<br/>Wadada wo-ho-ho wadada<br/>Even within I-man black race<br/>Wadada wo-ho-ho wadada<br/>No plague shall come up on I, to eat up I flesh<br/>Wadada wo-ho-ho wadada<br/>Keep them away Wadada<br/>Keep them away Wadada<br/>Wadada wo-ho-ho wadada<br/>Black Wadada<br/>Revive for I and I<br/>Wadada wo-ho-ho wadada<br/>Food, clothes and shelter<br/>Wadada wo-ho-ho wadada<br/>Grant unto I my heart desire<br/>Wadada wo-ho-ho wadada<br/>Each and everyone entitled to their heart's desire<br/>Wadada wo-ho-ho wadada<br/>Be with I and I and I<br/>Wadada wo-ho-ho wadada<br/>They take us away from Africa<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "5",
    "title": "Black Disciples",
    "duration": 194400,
    "path": "black_disciples.mp3",
    "lyric": "No, black disciples will never run away<br/>No, they will no frustrate<br/>They come to stay<br/><br/>Is a lucky thing I never get<br/>Swell headed<br/>Is a lucky thing I never get<br/>Swell headed<br/><br/>And started to run, run, run<br/>I will never run away<br/>And started to run, run, run<br/>I will never run away<br/><br/>Do you hear?<br/>I never run away<br/>I never run, never run<br/>Never run away<br/><br/>Deh a dem they say to I<br/>Deh who feel so nice, so nice<br/>Deh a dem they fight against I<br/>You should see dem rejoice and tell I to<br/><br/>Run, run, run<br/>I will never run away<br/>Run, run, run<br/>I will never run away<br/><br/>Do you hear?<br/>I never run away<br/>No I would never<br/>I never run, never run<br/>Never run away<br/>I and I will never run away!<br/><br/>My black brother call me, call me<br/>And he reason with me<br/>Everything he tells me<br/>Oh yes it's true<br/><br/>That's why I will never run, run, run<br/>I will never run away<br/>Run, run, run<br/>I will never run away<br/><br/>Do you hear?<br/>I never run away, no<br/>I never run, never run<br/>Never run away<br/><br/>I will never, will never<br/>Will never, could never<br/>I and I will never run away!<br/>I and I will never run away!<br/>No I will never run away<br/>I come to stay<br/>No I will never run away<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "6",
    "title": "Black Soul",
    "duration": 181800,
    "path": "black_soul.mp3",
    "lyric": "It is not good to travel today<br/>Neither to cross the ocean<br/>Desert's so dry<br/>Water-thirst kill you<br/><br/>Don't good to travel today<br/>Neither to cross the ocean<br/>Desert's so dry<br/>Water-thirst kill you<br/>Kill you, kill you, kill you<br/>Kill you, kill you<br/><br/>When it wet, it slippery, yeah<br/>When it damp, it cramp your belly<br/>Don't want to see you underground<br/>Don't want to see you underground<br/>Underground, underground, underground<br/><br/>Caution, my brother, caution, take heed<br/>Black soul, you're black as they<br/>Soul black, soul black<br/>Soul black, soul black, soul black<br/><br/>I'm proud I'm black<br/>I'm proud I'm black<br/>I'm rejoicing I'm black<br/>Who know black a go black again<br/>Who know black a go black again<br/>Soul black<br/>My skin is black<br/>Soul black, oh, soul black<br/><br/>Two more things for I to tell you right now<br/>Two more things for I to tell you right now<br/>Two more<br/><br/>My old great grandmother-mother-mother<br/>Great-great-great-greater-great<br/>Grandmother-mother-mother-mother<br/>She is black, soul black, yeah, she is black<br/><br/>My old great grandfather<br/>Greater-greater-great-great-great-great-great<br/>Grandfather-father-father-father-father-father-father, oh, oh<br/>He is black, soul black, soul black<br/><br/>So, don't good to travel today<br/>Neither to cross the ocean<br/>Desert's so dry<br/>Water-thirst kill you, oh<br/>Kill you, oh, kill you<br/><br/>Mmm, don't good to travel today<br/>Oh, neither to cross the ocean<br/>Mmm, oh, mmm..",
    "artist": "Burning Spear"
  },
  {
    "id": "7",
    "title": "Columbus",
    "duration": 202800,
    "path": "columbus.mp3",
    "lyric": "I and I all I know<br/>I and I all I say<br/>I and I reconsider<br/>I and I see upfully that<br/>Christopher Columbus is a damn blasted liar<br/>Christopher Columbus is a damn blasted liar<br/>Yes Jah<br/><br/>He's saying that, he is the first one<br/>Who discover Jamaica<br/>I and I say that<br/>What about the Arawak Indians and the few Black man<br/>Who were around here, before him<br/>The Indians couldn't hang on no longer<br/>Here comes first Black man and woman and children<br/>In a Jam Down Land ya<br/>A whole heap of mix up and mix up<br/>A whole heap a ben up, ben up<br/>We have fi straighten out<br/>Christopher Columbus is a damn blasted liar<br/>Christopher Columbus is a damn blasted liar<br/>Yes Jah<br/><br/>What a long stay from home<br/>I and I longing to go home<br/>Within a Red, Green, and Gold Robe<br/>Come on Twelve Tribe of Isreal<br/>Come on Twelve Tribe of Isreal<br/>Out a Jam Down land ya<br/>A whole heap of mix up mix up<br/>A whole heap a ben up, ben up<br/>Come on Twelve Tribe of Isreal<br/>Come on Twelve Tribe of Isreal<br/>Out a Jam Down land ya<br/><br/>Christopher Columbus is a damn blasted liar<br/>Christopher Columbus is a damn blasted liar<br/>Yes Jah, he is a liar<br/>Yes Jah, he is a liar<br/>Yes Jah, he is a liar<br/>Columbus is a liar<br/>Yes jah Christopher Columbus is a damn blasted liar<br/>Columbus<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "8",
    "title": "Door Peep",
    "duration": 144000,
    "path": "door_peep.mp3",
    "lyric": "I an' I, son of the most high, Jah Rastafari.<br/>Our hearts shall correspond and beat in one harmony.<br/>Sounds from the Burning Spear:<br/><br/>Door peep shall not enter, this a holy land.<br/>Where wise and a true man stand, sipping from the cup of peace.<br/><br/>Chant down a Babylon, yeah.<br/>Chant down Babylon.<br/>Chant down a Babylon, yeah.<br/>Chant down Babylon.<br/><br/>Give thanks and praise!<br/>Give thanks and praise!<br/>Give thanks and praise!<br/>Give thanks and praise!<br/>To the holy man of creation.<br/><br/>I, I, I, I..<br/><br/>(..)<br/><br/>Chant down a Babylon, yeah.<br/>Chant down Babylon.<br/>Chant down a Babylon, yeah.<br/>Chant down Babylon.<br/><br/>Give thanks and praise!<br/>Give thanks and praise!<br/>Give thanks and praise!<br/>Give thanks and praise!<br/>To the holy man of creation.<br/><br/>I, I, I, I..<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "9",
    "title": "Dry & Heavy",
    "duration": 195600,
    "path": "dry_and_heavy.mp3",
    "lyric": "The wood dry, but it still heavy<br/>The wood dry, but it still heavy<br/>So dry, bone dry<br/>It was more than one and two and three<br/>And four and five and six of us<br/>Went to the wood bush<br/>I-man forgot I axe I said<br/>Lend me your axe, will you lend it to me<br/>Lend me your axe, lend me your axe<br/>Lend me your axe<br/><br/>I know and my mother know<br/>You gots to run around<br/>And play some kinds of game<br/>Now I come I say<br/>Help me down, will someone<br/>Help me down, this wood dry, but it heavy<br/>Help me down, give I a helping hand<br/>Help me down<br/>Help me down<br/><br/>(..)<br/><br/>Some have a iron, electric iron<br/>Some have a iron, wood fire iron<br/>Anyway<br/>Warm up your iron<br/>Press up the uniform them<br/>Khaki pants and shirt involve<br/>Monday morning coming<br/>Sing it<br/>School days, school days<br/>Please obey<br/>Hear what your mother say<br/>This is, this is, this is, this is<br/>School days, school days<br/><br/>The wood, dry but it still heavy<br/>The wood, dry but it still heavy<br/>Bone dry, but it still heavy<br/>So dry, but it still heavy<br/>Well dry, but it still heavy<br/>Drier than dry, but it still heavy<br/>The whole dry, but it still heavy<br/>The wood dry, but it still heavy<br/><br/>Yeah<br/>It was more than one and two and three<br/>And four and five and six of us<br/>Been to the wood bush<br/>I-man forgot I axe<br/>Oh, will you lend me your axe<br/>Will you lend me your saw..<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "10",
    "title": "Estimated Prophet",
    "duration": 375000,
    "path": "estimated_prophet.mp3",
    "lyric": "You should believe me<br/><br/>My time coming any day, don't worry 'bout me, no<br/>It's been so long I felt this way, I's in no hurry, no<br/>Rainbows end down that highway, where ocean breezes blow<br/>My time coming, voices saying, they tell me where to go<br/><br/>California, preaching on the burning shore<br/>California, be knocking on the golden door<br/>Like an angel, standing in a shaft of light<br/>Yes, like an angel, rising up to paradise<br/>I know I'm gonna shine, yes, I'm gonna (shine)<br/><br/>My time coming any day, don't worry 'bout me, no<br/>It's gonna be just like they say, them voices tell me so<br/>Seems so long I felt this way, and time sure passes slow<br/>Still, I know I lead the way, they tell me where I go<br/><br/>California, a prophet on the burning shore<br/>California, I will be knocking on the golden door<br/>Like an angel, standing in a shaft of light<br/>Yes, like an angel, rising up to paradise<br/>I know I'm gonna shine, yes, I'm gonna<br/><br/>You have all been asleep, you will not believe me<br/>Them voices telling me, them voices, you will soon receive me<br/>We are standing on the beach, the sea will part before me<br/>Fire wheel burning in the air<br/>You will follow me, and we will ride to glory<br/>Way up in the middle of the air<br/>And I'll call down thunder, thunder and rain, and speak, speak the same<br/>And my words fill the sky with flame<br/>And might, glory gonna be my name<br/>And men gonna light my way, my way, light my way<br/>My time coming any day, don't worry about me, no<br/>It's gonna be just like they say, them voices tell me so<br/>Seems so long I felt this way and time sure passes slow<br/>I am in no hurry, oh, no, no, I know where to go<br/><br/>My time coming<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "11",
    "title": "Ethiopians Live It Out",
    "duration": 189000,
    "path": "ethiopians_live_it_out.mp3",
    "lyric": "One a dem come - they couldn't live it out.<br/>Two a dem come - they couldn't live it out.<br/>Three a dem come - they couldn't live it out.<br/>Four a dem come - they couldn't live it out.<br/><br/>Ethiopians live it out!<br/>Ethiopians live it out!<br/>Ethiopians live it out!<br/>Ethiopians live it out!<br/><br/>Oh, chiney men come - they couldn't live it out.<br/>Coolie men come - they couldn't live it out.<br/>Syrian come - they couldn't live it out.<br/>White men come - they couldn't live it out.<br/><br/>Ethiopians live it out - oh we dweet.<br/>Ethiopians live it out - oh forever.<br/>Ethiopians live it out..<br/><br/>One a dem come - they couldn't live it out.<br/>Two a dem come - they couldn't live it out.<br/>Three a dem come - they couldn't live it out.<br/>Four a dem come - they couldn't live it out..<br/><br/>Ethiopians live it out!<br/>Ethiopians live it out!<br/>Ethiopians live it out!<br/>Ethiopians live it out!<br/><br/>Oh, chiney men come - they couldn't live it out.<br/>Coolie men come - they couldn't live it out.<br/>Syrian come - they couldn't live it out.<br/>White men come - they couldn't live it out.<br/><br/>Ethiopians live it out!<br/>Ethiopians live it out!<br/>Ethiopians live it out!<br/>Ethiopians live it out!<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "12",
    "title": "Fire Down Below",
    "duration": 199200,
    "path": "fire_down_below.mp3",
    "lyric": "Fire, down below, I said fire, down below<br/>And the people dem a running around<br/>And the people dem a running around<br/><br/>How you not sleep, get a cup of tea<br/>How you not sleep, get a cup of tea<br/>I have a little tea pot, short and stout<br/>This is my handle, this is my spout<br/>A when I get my tea yeah, then I will shout<br/>You gots to tip, tip it over, people then you pour me out<br/><br/>I said fire, fire now, down below<br/>I said fire, fire now, down below<br/><br/>(..)<br/><br/>Fire, down below, I said fire, down below<br/>And the people dem a running around<br/>And the people dem running around<br/><br/>How you not sleep, get a cup of tea<br/>How you not sleep, get a cup of tea<br/>I have a little tea pot, short and stout<br/>This is my handle, this is my spout<br/>When I get my tea yeah, then I will shout<br/>You gots to tip, tip it over, people then you pour me out<br/><br/>I said fire, fire now, down below<br/>I said fire, down below<br/>And the people dem running around<br/>And the people dem running around<br/>I said fire, fire now, down below<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "13",
    "title": "Follow Marcus Garvey",
    "duration": 255000,
    "path": "follow_marcus_garvey.mp3",
    "lyric": "Follow, follow, follow, follow, follow Marcus Garvey foot step<br/>Why can't I and I and I and I, follow him - come on<br/>Follow, follow, follow, follow Marcus Garvey foot step<br/>Why can't I and I and I, follow him<br/><br/>Every where he go, I and I will go there too<br/>And everything he say, oh yes, is true<br/>So why can't I and I and I and I follow him<br/>Come on, come on, let us follow him<br/>Follow, follow, follow, follow, follow Marcus Garvey foot step<br/>Why can't I and I and I and I follow him<br/>He never commit no crime, he always do right<br/>So why can't I and I and I follow him<br/><br/>Follow, follow, follow, follow Marcus Garvey foot step<br/>Why can't I and I and I follow him - come on<br/><br/>(..)<br/><br/>Follow, follow, follow, follow, follow Marcus Garvey foot step<br/>Follow, follow, follow, follow, follow him<br/><br/>He never disobeyed his grandmother, no<br/>He always obeyed his grandfather<br/>So why can't I and I and I and I follow him<br/>Yes, we should, we should follow him<br/>Come on, follow, follow, follow, follow Marcus Garvey foot step<br/>Why can't I and I and I and I follow him<br/>We should forward, I'm ready, do you ready?<br/>I'm waiting on you, yeah<br/>Follow him, come on<br/>Let's go where he go<br/>Let's say the words he say, oh yes, it's true, alright<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "14",
    "title": "Give Me",
    "duration": 187200,
    "path": "give_me.mp3",
    "lyric": "Give me what is mine<br/>(Give me) Free I-sence<br/>(Give me) Free I-sence<br/>(Give me) Set me free let me be<br/>(Give me) Free from all misery<br/><br/>(Give me) Why won't you give me (give me)<br/>People people (good people heed me)<br/>People people (good people heed me)<br/><br/>Yeah.. why won't you, why won't you<br/>(Give me) Free I-sence<br/>(Give me) Set me free let me be<br/>(Give me) Free<br/>(Give me)<br/><br/>Sit up every day (only want to receive)<br/>Sit up every day (only want to receive)<br/>You never have a thing to give away<br/>You never have a thing to give away<br/>But you must Give me what is mine<br/><br/>(Give me) I want it<br/>(Give me) Give it to me<br/>(Give me) It belongs to me<br/>(Give me)<br/><br/>You go your ways, and I go mine<br/>You go your ways, and I go mine<br/>You go your ways, and I go mine<br/>I'm sure I will hold my head up straight on the line<br/>I'm sure I will hold my head up straight on the line<br/>But you must, give me what is mine<br/><br/>(Give me) I want it<br/>(Give me) Give me what is mine<br/>(Give me) Can't you see it's mine<br/>(Give me) It belongs to me<br/>(Give me) I want it<br/>(Give me) I wouldn't commit no crime<br/>(Give me) Give me what is mine Give me<br/>(Give me) Give it to me<br/>(Give me) Can't you see<br/>(Give me) Wo-ho-ho<br/>(Give me) Wo-ho-ho, wo-ho-ho<br/>(Give me) Give me! Give me!<br/>(Give me) Give me! Why won't you..<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "15",
    "title": "Hail H.I.M",
    "duration": 249600,
    "path": "hail_h_i_m.mp3",
    "lyric": "Hail Jah Ta Fari, hail Jah Ta Fari<br/>Hail Him for everything which is good, hail Him<br/>Hail Him for food, hail Him for Shelter<br/>Hail Him for clothes, hail Him for everything<br/>Everything which is good<br/>Hail Jah Ta Fari, hail Jah Ta Fari<br/>Hail Jah Ta Fari<br/>Before you go to your rest, hail Him<br/>When you wake up and see the light, hail Him<br/>Hail Him without any apology<br/>Hail His Imperial Majesty, you Hail Him<br/>Hail Jah Ta Fari<br/>Ta Fari<br/><br/>(..)<br/><br/>Hail Him for guidance<br/>Hail Him for protection<br/>Hail Him for providance<br/>Hail Him for everything<br/>Everything which is good<br/>Hail Jah Ta Fari<br/>Hail Jah Ta Fari, hail Jah<br/><br/>I and I don't in league with wrong<br/>I and I and I speak about right<br/>So I and I would have to hail Him<br/>Hail Jah Ta Fari, hail Jah Ta Fari<br/>Hail Him for everything which is good<br/>Hail Him without any apology<br/>Hail Him..<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "16",
    "title": "I And I Survive (Slavery Days)",
    "duration": 213000,
    "path": "i_and_i_survive_slavery_days.mp3",
    "lyric": "Do you remember the days of slav'ry?<br/>Do you remember the days of slav'ry?<br/><br/>Do you remember the days of slav'ry?<br/>(Do you remember the days of slav'ry?)<br/>Do you remember the days of slav'ry?<br/>(Do you remember the days of slav'ry?)<br/><br/>And they beat us (do you remember the days of slav'ry?)<br/>And the work was so hard (do you remember the days of slav'ry?)<br/>And they used us (do you remember the days of slav'ry?)<br/>Till they refuse us (do you remember the days of slav'ry?)<br/>Do you remember the days of slav'ry?<br/>(Do you remember the days of slav'ry?)<br/><br/>(Hmm-mmm) The big fat boat<br/>(Hmm-mmm) We usually pull it, we pull it<br/>(Hmm-mmm) We must pull it<br/>(Hmm-mmm) With shackles around our necks<br/>(Hmm-mmm) Believe me and we sit so close<br/>Do you remember the days of slav'ry?<br/>(Do you remember the days of slav'ry?)<br/><br/>My brother feels it (do you remember the days of slav'ry?)<br/>Including my sisters too (do you remember the days of slav'ry?)<br/><br/>Some of us survive (do you remember the days of slav'ry?)<br/>Showing them that we are still alive<br/>(Do you remember the days of slav'ry?)<br/><br/>Do you remember the days of slav'ry?<br/>(Do you remember the days of slav'ry?)<br/>History can recall, history can recall<br/>(Do you remember the days of slav'ry?)<br/>History can recall the days of slav'ry<br/>(Do you remember the days of slav'ry?)<br/><br/>Oh slav'ry day (do you remember the days of slav'ry?)<br/>Oh slav'ry day (do you remember the days of slav'ry?)<br/><br/>Try and remember, please remember<br/>(Do you remember the days of slav'ry?)<br/>Do you, do you, do you; do you, do you, do you?<br/>(Do you remember the days of slav'ry?)<br/>Oh slav'ry day (do you remember the days of slav'ry?)<br/>Oh slav'ry day (do you remember the days of slav'ry?)<br/>Try and remember, please remember..<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "17",
    "title": "Institution",
    "duration": 198000,
    "path": "institution.mp3",
    "lyric": "Mister Garvey is so cool<br/>Mister Garvey is so smooth<br/>That's why he go to school<br/>He is the first one through<br/>Black history, who ever control so much people<br/>Hundreds, thousands, millions, he cause an eruption<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "18",
    "title": "It's A Long Way Around",
    "duration": 184200,
    "path": "it's_a_long_way_around.mp3",
    "lyric": "Travel up the ol' rough road<br/>To find my bread, to find my bread<br/>Call so loud, search all around<br/>No one to hear my cry<br/>What am I to do?<br/>I don't know, that's why<br/><br/>They call me now, creation<br/>Rebel now, rebel now, rebel now<br/>They call me now, creation<br/>Rebel now, rebel now, rebel now<br/>Creation rebel they call me<br/><br/>One thing more for I to tell you<br/>For I to tell you<br/>For I to tell, for I to tell you<br/>One thing more for I to tell you<br/>One shoe on my feet<br/>One pants to my waist<br/>One shirt on my back<br/>Is gone, is gone<br/>What am I to do?<br/>I don't know, that's why<br/><br/>They call me now, creation<br/>Rebel now, rebel now<br/>Creation rebel they call me<br/><br/>Rebels in the morning, rebels in the evening<br/>Rebels I-niversally, rebels was from that time<br/>Until this time, I made up my mind<br/>Go on, sing my song<br/>Maybe, maybe<br/>I will find good 'round the other side<br/>That's why they call me creation rebel, they call me<br/>Rebel right, rebel right, rebel right, rebel, rebel right<br/>Rebel right, rebel right, rebel right..<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "19",
    "title": "Live Good",
    "duration": 147600,
    "path": "it's_good.mp3",
    "lyric": "Try my best to live good<br/>Yes, yes, yes<br/>Try my best to do the right<br/>Do all the right I can<br/>Yes, yes, yes<br/><br/>I don't know what wrong have I done you<br/>I don't know, no, no, no<br/>I don't know, what wrong have I done you<br/>I don't know, no, no, no<br/><br/>All I know I must speak, I must<br/>Yes, yes, yes<br/>All I know I must live, I must<br/>Yes, yes, yes<br/><br/>(..)<br/>Yes, yes, yes<br/>Yes, yes, yes<br/>Yes, yes, yes<br/><br/>I don't know what wrong have I done you<br/>I don't know, no, no, no<br/>I don't know, what wrong have I done you<br/>I don't know, no, no, no<br/><br/>All I know I must speak, I must<br/>Yes, yes, yes<br/>All I know I must live, I must<br/>Yes, yes, yes<br/><br/>All I know is..<br/><br/>",
    "artist": "Burning Spear"
  },
  {
    "id": "20",
    "title": "Jah Kingdom",
    "duration": 215400,
    "path": "jah_kingdom.mp3",
    "lyric": "No matter where we go<br/>We are the lions in His kingdom<br/>No matter where we go<br/>We are the lions in His kingdom<br/>Lion in His kingdom<br/>Lion in His kingdom<br/>Dreadlock in His kingdom<br/>Rasta in His kingdom<br/>Love in His kingdom<br/><br/>No matter where we go<br/>We are the lions in His kingdom<br/>No matter where we go<br/>We are the lions in His kingdom<br/>Lion in His kingdom<br/>Lies in His kingdom<br/>Eat in His kingdom<br/>Reason His kingdom<br/><br/>Jah kingdom, yes, Jah kingdom<br/>Jah kingdom, yes, Jah kingdom<br/>Jah kingdom, yes, Jah kingdom<br/>Jah kingdom, yes, Jah kingdom<br/><br/>No matter where we go<br/>We are the lions in His kingdom<br/>No matter where we go<br/>We are the lions in His kingdom<br/>Lion in his kingdom<br/>Fear no one in His kingdom<br/>Fear no one in His kingdom<br/>Nyabinghi in His kingdom<br/>Twelve Tribe in His kingdom<br/>Bobo in his kingdom<br/><br/>No matter where we go<br/>We are the lions in His kingdom<br/>No matter where we go<br/>We are the lions in his kingdom<br/>Lion in His kingdom<br/>Lion in His kingdom<br/><br/>",
    "artist": "Burning Spear"
  }
]